# Creating a DataFrame

In [1]:
#Createing DataFrame fro List of Lists

In [3]:
import pandas as pd

In [4]:
list_data = [["C1", 5, "Jakarta"], ["C2", 10, "Bogor"], ["C3", 7, "Tangerang"], ["C4", 0, "Jakarta"]]

In [5]:
df = pd.DataFrame(list_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [6]:
#Creating DataFrame from Numpy Array

In [7]:
import numpy as np

In [8]:
numpy_data = np.array(list_data)
numpy_data

array([['C1', '5', 'Jakarta'],
       ['C2', '10', 'Bogor'],
       ['C3', '7', 'Tangerang'],
       ['C4', '0', 'Jakarta']], dtype='<U11')

In [9]:
df = pd.DataFrame(numpy_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1           5    Jakarta
1      C2          10      Bogor
2      C3           7  Tangerang
3      C4           0    Jakarta

In [10]:
#Creating DataFrame from Dictionary

In [11]:
dict_data = { "cust_id": ["C1", "C2", "C3", "C4"],
             "item_bought": [5,10,7,10],
             "city": ["Jakarta", "Bogor", "Tangerang", "Jakarta"]}

dict_data

{'cust_id': ['C1', 'C2', 'C3', 'C4'],
 'item_bought': [5, 10, 7, 10],
 'city': ['Jakarta', 'Bogor', 'Tangerang', 'Jakarta']}

In [12]:
df = pd.DataFrame(dict_data)
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [13]:
#Saving a DataFrame

In [14]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [15]:
df.to_csv("customer_info.csv", index = False)

In [16]:
df.to_excel("customer_info.xlsx", index = False)

In [17]:
#Load a DataFrame

In [18]:
df = pd.read_csv("customer_info.csv")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [19]:
df = pd.read_excel("customer_info.xlsx")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

### Basic Operations

In [20]:
#Summary Infor

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      4 non-null      object
 1   item_bought  4 non-null      int64
 2   city         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes